#1. Поработайте с переменными, создайте несколько, выведите на экран. Запросите у пользователя некоторые числа и строки и сохраните в переменные, затем выведите на экран.
def task_1():
    a = 1
    b = 2
    c = 3
    uservar = input("введите имя:")
    print(f'a={a}, b={b}, c={c}\nhello {uservar}')
#2. Пользователь вводит время в секундах. Переведите время в часы, минуты, секунды и выведите в формате чч:мм:сс. Используйте форматирование строк.
def task_2():
    usertime = input("введите время в секундах:")
    try:
        value = int(usertime)
    except ValueError:
        print("не целочисловое значение")
    hh = value//3600
    mm = value // 60
    ss = value% 60
    while mm>60:
        mm=mm-60
    if mm < 9:
        print(f'{hh}:0{mm}:{ss}')
    else:
        print(f'{hh}:{mm}:{ss}')
#3. Узнайте у пользователя число n. Найдите сумму чисел n + nn + nnn. Например, пользователь ввёл число 3. Считаем 3 + 33 + 333 = 369.
def task_3():
    usernumber = input("введите число:")
    num_1 = usernumber
    num_2 = usernumber*2
    num_3 = usernumber*3
    print(f'n+n+n={int(num_1)+int(num_2)+int(num_3)}')
#4. Пользователь вводит целое положительное число. Найдите самую большую цифру в числе. Для решения используйте цикл while и арифметические операции.
def task_4():
    number = 3554436755
    print(int(max(str(number))))
#5. Запросите у пользователя значения выручки и издержек фирмы. Определите, с каким финансовым результатом работает фирма. Например, прибыль — выручка больше издержек, или убыток — издержки больше выручки. Выведите соответствующее сообщение.
def task_5():
    revenue = input("введите выручку:")
    costs = input("введите издержки:")
    if float(revenue) > float(costs):
        print(f"вы в плюсе на {float(revenue)-float(costs)}")
    else:
        print(f"вы в минусе на {float(costs)-float(revenue)}")
#6. Если фирма отработала с прибылью, вычислите рентабельность выручки. Это отношение прибыли к выручке. Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчёте на одного сотрудника.
def task_6():
    revenue = input("введите выручку:")
    costs = input("введите издержки:")
    if float(revenue) > float(costs):
        print(f"рентабельность составляет:{float(revenue)/float(costs)}")
        count_people = input("введите численность сотрудников:")
        profit_per_user = (float(revenue)-float(costs))/float(count_people)
        print(f'прибыль на одного сотрудника: {profit_per_user}')
    else:
        print(f"не рентабельно:{float(revenue)/float(costs)}")
#7. Спортсмен занимается ежедневными пробежками. В первый день его результат составил a километров. Каждый день спортсмен увеличивал результат на 10% относительно предыдущего. Требуется определить номер дня, на который результат спортсмена составит не менее b километров. Программа должна принимать значения параметров a и b и выводить одно натуральное число — номер дня.
def task_7():
    a = input("введите результат в км первый день:")
    b = input("введите результат в км n день:")
    start_path_km = float(a)
    end_path_km = float(b)
    count = 1
    while start_path_km<=end_path_km:
        start_path_km+=start_path_km*0.1
        count+=1
        print(f'{count}-й день:{round(start_path_km,2)}')
    print(f'на {count} день спортсмен достиг результата — не менее {end_path_km} км')

if __name__ == "__main__":
    #task_1()
    #task_2()
    #task_3()
    #task_4()
    #task_5()
    #task_6()
    #task_7()
